01  WS-AREA-1 PIC 9(5) VALUE 99999.
01  WS-AREA-2 PIC 9(5) VALUE 99999.

PROCEDURE DIVISION.

    ADD WS-AREA-1 TO WS-AREA-2
       ON SIZE ERROR DISPLAY "Error: Arithmetic overflow".

    STOP RUN.